av_catalog = {
    "欧美":{
        "www.youporn.com": ["很多免费的,世界最大的","质量一般"],
        "www.pornhub.com": ["很多免费的,也很大","质量比yourporn高点"],
        "letmedothistoyou.com": ["多是自拍,高质量图片很多","资源不多,更新慢"],
        "x-art.com":["质量很高,真的很高","全部收费,屌丝请绕过"]
    },
    "日韩":{
        "tokyo-hot":["质量怎样不清楚,个人已经不喜欢日韩范了","verygood"]
    },
    "大陆":{
        "1024":["全部免费,真好,好人一生平安","服务器在国外,慢"]
    }
}
# 1，给此 ["很多免费的,世界最大的","质量一般"]列表第二个位置插入一个元素：'量很大'。
# av_catalog['欧美'][ "www.youporn.com"].insert(1,'量很大')
# print(av_catalog)
# 2，将此 ["质量很高,真的很高","全部收费,屌丝请绕过"]列表的 "全部收费,屌丝请绕过" 删除。
# av_catalog['欧美']["x-art.com"].remove("全部收费,屌丝请绕过")
# print(av_catalog)
# 3，将此 ["质量很高,真的很高","全部收费,屌丝请绕过"]列表的 "全部收费,屌丝请绕过" 删除。


# 4，将此["质量怎样不清楚,个人已经不喜欢日韩范了","verygood"]列表的 "verygood"全部变成大写。
# 5，给 '大陆' 对应的字典添加一个键值对 '1048' :['一天就封了']
# 6，删除此"letmedothistoyou.com": ["多是自拍,高质量图片很多","资源不多,更新慢"]键值对。




# 7，给此["全部免费,真好,好人一生平安","服务器在国外,慢"]列表的第一个元素，加上一句话：'可以爬下来'
# av_catalog['大陆']['1024'][0] = av_catalog['大陆']['1024'][0] + '可以爬下来'
# print(av_catalog)
# av_catalog['大陆']['1024'][0] += '可以爬下来'
# print(av_catalog)

#4、有字符串"k :1|k1 :2|k2 :3|k3 :4" 处理成字典 {'k':1,'k1':2....}
s = 'k:1|k1:2|k2:3|k3:4'
# li = s.split('|')
# dic = {}
# for i in li:
#     dic[i.split(':')[0]] = int(i.split(':')[1])
# print(dic)
# dic = {'k':1,'k1':2}
# dic = {}
# for i in s.strip().split('|'):  # ['k:1','k1:2'。。。。]
#     i = i.strip().split(':')  # ['k ','1']
#     dic[i[0].strip()] = int(i[1])
# print(dic)
#5、元素分类

# 有如下值li= [11,22,33,44,55,66,77,88,99,90]，将所有大于 66 的值保存至字典的第一个key中，将小于 66 的值保存至第二个key的值中。
# 即： {'k1': 大于66的所有值列表, 'k2': 小于66的所有值列表}
# dic = {'k1':[],'k2':[]}
# li= [11,22,33,44,55,77,88,99,90]
# for i in li:
#     if i > 66:
#        dic['k1'].append(i)
#     else:
#         dic['k2'].append(i)
# print(dic)
# li= [11,22,33,44,55,77,88,99,90]
# dic = {}
# for i in li:
#     ...
'''
6、输出商品列表，用户输入序号，显示用户选中的商品
    商品 li = ["手机", "电脑", '鼠标垫', '游艇']
要求：1：页面显示 序号 + 商品名称，如：
      	1 手机
	   	2 电脑
     		 …
     2： 用户输入选择的商品序号，然后打印商品名称
  3：如果用户输入的商品序号有误，则提示输入有误，并重新输入。
4：用户输入Q或者q，退出程序。
'''
li = ["手机", "电脑", '鼠标垫', '游艇']
while True:
    for i in li:
        print('{}\t{}'.format(li.index(i)+1,i))
    num = input('请输入商品序号：q/Q退出').strip()
    if num.isdigit():
        num = int(num)
        if num > 0 and num <= len(li):
            print(li[num - 1])
        else:
            print('您输入的选项，超出范围，请重新输入')
    elif num.upper() == 'Q':break
    else:
        print('输入的有非数字，请重新输入')