# 周一中午12点之前
#     交到周五那天的作业
#     12:05 三次不交就去下一期

# 哪吒 李文周
    # 热情高涨    一个月
    # 犹豫
    # 着急毕业 5个月
    # 心虚

#  作业的重要性
    # 善于整理  图 基础数据类型 文件处理 函数 面向对象
    # 对课上的例子
        # 先回忆一下讲的大知识点，往大知识点中填充你能记得住的例子
        # 往例子中填充代码
        # 把你的知识导图完善
        # 写作业和预习和默写

        # 对照笔记把每一个例子看懂，边看边把例子的 要做的事情（知识点）记下来——中文
            # 1.问你身边的同学
            # 2.查看视频  20分钟
            # 3.问老师
        # 对照着中文把每一个例子的代码写出来
            # 1.觉得困难  就对照着代码写中文 在中文译成代码
            # 2.觉得简单  敲一遍

# 作业的重要性
    # 竭尽所能的完成作业
    # 分析这个作业 中文
    # 代码
    # 靠我自己的努力 我完成了哪些功能


# 作业的规范
    # 作业的py文件
    # 流程图
    # readme文件 文本文件

# 画流程图

# 登陆
    # 管理员 老师 学生
        # 方法1 ：选择身份 输入用户名和密码  登录进来直接就知道身份
            #  管理员
            #  老师
            #  学生
        # 方法2 ：输入用户名和密码 自动显示你的身份
            # 用户名 密码 身份
# 根据身份显示这个角色能做的事情
    # 管理员： 创建班级 创建课程 创建老师账号 创建学生账号
    #          给课程绑定老师  给班级添加学生
    #          查看班级 查看学生 查看老师
    # 老师：查看所教班级
        #   查看所教课程
        #   查看所教的学生
    # 学生：查看所学的课程
        #   查看所在班级

# 文件
# 登陆文件
# 老师的信息
# 班级的信息
# 课程的信息

# 必须完成登陆功能
# 以及对整个系统内有多少个类
# 每个类的属性
# 列出所有你能想到的功能
# 完成类中的方法 ：首先从管理员类开始完成
# 思考 ： 老师 课程 班级 学生 之间如何关联 数据如何存储
class Teacher:
    def __init__(self,name):
        self.name = name


    def check_class(self):pass

# 把之前能看懂的代码 必须是作业 员工信息表
    # 两个代码加注释 画流程图

