# 小马哥
# 前端 —— html css js jq
# 4个月
# 全栈开发
# 框架 模板
# 3周
# 底层语言 js 所有的你在前端中遇到的动态效果
# js 非常麻烦  —— 简单讲
# jq 封装js的包 90%的js能实现的功能 —— ！！！
# 前端   小马哥
# 数据库 小马哥
# 苑昊 diango基础 2-3项目
# wusir tornado flask 就业指导

# 并发的 ： 多进程 多线程 协程
# 阻塞都用不上CPU CPU的执行速度非常快
# IO多的 线程 协程  # 任务过多 协程 500个任务 —— CPU
# 高计算 多进程 # 多进程启动协程
# 其他语言
    # 多进程 数据隔离 可以利用多核
    # 多线程 数据不隔离 可以利用多核
    # 协程   数据不隔离 不能利用多核
# CPython解释器下的python语言
    # 多进程 数据隔离 可以利用多核
    # 多线程 数据不隔离 不能利用多核
    # 协程   数据不隔离 不能利用多核  ！！！
# socketserver 并发编程 异步
# 同步 —— 单进程 单线程 没协程
# 异步 —— 多个任务 并发  在执行一个操作的同时 又有另外一个任务也在执行
# 阻塞 和 非阻塞
# input accept recv recvfrom read
# sleep join
# print send write log.debug

# socket












